# Pandas Class 4 Data Manipulation

# 1. Group by operation

In [7]:
import numpy as np 
import pandas as pd 
import matplotlib as plt 
import os

data ={'Company':['GOOG', 'GOOG', 'MICR', 'MICR', 'FB', 'FB'],
       'Person':['Sam', 'Charli', 'Chaplin', 'Mahendra', 'Singh', 'Dhoni'],
       'Sales':[200,399,400,200,500,444]}

data_new=pd.DataFrame(data)
data_new

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG    Charli    399
2    MICR   Chaplin    400
3    MICR  Mahendra    200
4      FB     Singh    500
5      FB     Dhoni    444

In [15]:
bycompy=data_new.groupby(['Company'])
bycompy.mean()

         Sales
Company
FB       472.0
GOOG     299.5
MICR     300.0

In [16]:
bycompy.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  472.0   39.597980  444.0  458.00  472.0  486.00  500.0
GOOG      2.0  299.5  140.714249  200.0  249.75  299.5  349.25  399.0
MICR      2.0  300.0  141.421356  200.0  250.00  300.0  350.00  400.0